# BASIC PYTHON PRACTICE

In [87]:
even = []
start , end = 20, 100
comp_even = [num for num in range (start, end+1)  if num %2 == 0]
print(comp_even)

[20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100]

In [88]:
odd = []
start, end = 10, 20
comp_odd = [num for num in range (start, end +1)  if num %2 != 0]
print(comp_odd)

[11, 13, 15, 17, 19]

In [89]:
even1 = {}
start = 5 
end = 60 
comp_even1 = {str(num): num for num in range (start, end+1)  if num % 2 == 0}
print(comp_even1)

{'6': 6, '8': 8, '10': 10, '12': 12, '14': 14, '16': 16, '18': 18, '20': 20, '22': 22, '24': 24, '26': 26, '28': 28, '30': 30, '32': 32, '34': 34, '36': 36, '38': 38, '40': 40, '42': 42, '44': 44, '46': 46, '48': 48, '50': 50, '52': 52, '54': 54, '56': 56, '58': 58, '60': 60}

In [90]:
odd1 = {}
start = 8 
end = 1001
comp_odd1 = {str(num): num for num in range (start,end+1)  if num % 2 != 0}
comp_odd1

{'9': 9,
 '11': 11,
 '13': 13,
 '15': 15,
 '17': 17,
 '19': 19,
 '21': 21,
 '23': 23,
 '25': 25,
 '27': 27,
 '29': 29,
 '31': 31,
 '33': 33,
 '35': 35,
 '37': 37,
 '39': 39,
 '41': 41,
 '43': 43,
 '45': 45,
 '47': 47,
 '49': 49,
 '51': 51,
 '53': 53,
 '55': 55,
 '57': 57,
 '59': 59,
 '61': 61,
 '63': 63,
 '65': 65,
 '67': 67,
 '69': 69,
 '71': 71,
 '73': 73,
 '75': 75,
 '77': 77,
 '79': 79,
 '81': 81,
 '83': 83,
 '85': 85,
 '87': 87,
 '89': 89,
 '91': 91,
 '93': 93,
 '95': 95,
 '97': 97,
 '99': 99,
 '101': 101,
 '103': 103,
 '105': 105,
 '107': 107,
 '109': 109,
 '111': 111,
 '113': 113,
 '115': 115,
 '117': 117,
 '119': 119,
 '121': 121,
 '123': 123,
 '125': 125,
 '127': 127,
 '129': 129,
 '131': 131,
 '133': 133,
 '135': 135,
 '137': 137,
 '139': 139,
 '141': 141,
 '143': 143,
 '145': 145,
 '147': 147,
 '149': 149,
 '151': 151,
 '153': 153,
 '155': 155,
 '157': 157,
 '159': 159,
 '161': 161,
 '163': 163,
 '165': 165,
 '167': 167,
 '169': 169,
 '171': 171,
 '173': 173,
 '175': 175,
 '177': 177,
 '179': 179,
 '181': 181,
 '183': 183,
 '185': 185,
 '187': 187,
 '189': 189,
 '191': 191,
 '193': 193,
 '195': 195,
 '197': 197,
 '199': 199,
 '201': 201,
 '203': 203,
 '205': 205,
 '207': 207,
 '209': 209,
 '211': 211,
 '213': 213,
 '215': 215,
 '217': 217,
 '219': 219,
 '221': 221,
 '223': 223,
 '225': 225,
 '227': 227,
 '229': 229,
 '231': 231,
 '233': 233,
 '235': 235,
 '237': 237,
 '239': 239,
 '241': 241,
 '243': 243,
 '245': 245,
 '247': 247,
 '249': 249,
 '251': 251,
 '253': 253,
 '255': 255,
 '257': 257,
 '259': 259,
 '261': 261,
 '263': 263,
 '265': 265,
 '267': 267,
 '269': 269,
 '271': 271,
 '273': 273,
 '275': 275,
 '277': 277,
 '279': 279,
 '281': 281,
 '283': 283,
 '285': 285,
 '287': 287,
 '289': 289,
 '291': 291,
 '293': 293,
 '295': 295,
 '297': 297,
 '299': 299,
 '301': 301,
 '303': 303,
 '305': 305,
 '307': 307,
 '309': 309,
 '311': 311,
 '313': 313,
 '315': 315,
 '317': 317,
 '319': 319,
 '321': 321,
 '323': 323,
 '325': 325,
 '327': 327,
 '329': 329,
 '331': 331,
 '333': 333,
 '335': 335,
 '337': 337,
 '339': 339,
 '341': 341,
 '343': 343,
 '345': 345,
 '347': 347,
 '349': 349,
 '351': 351,
 '353': 353,
 '355': 355,
 '357': 357,
 '359': 359,
 '361': 361,
 '363': 363,
 '365': 365,
 '367': 367,
 '369': 369,
 '371': 371,
 '373': 373,
 '375': 375,
 '377': 377,
 '379': 379,
 '381': 381,
 '383': 383,
 '385': 385,
 '387': 387,
 '389': 389,
 '391': 391,
 '393': 393,
 '395': 395,
 '397': 397,
 '399': 399,
 '401': 401,
 '403': 403,
 '405': 405,
 '407': 407,
 '409': 409,
 '411': 411,
 '413': 413,
 '415': 415,
 '417': 417,
 '419': 419,
 '421': 421,
 '423': 423,
 '425': 425,
 '427': 427,
 '429': 429,
 '431': 431,
 '433': 433,
 '435': 435,
 '437': 437,
 '439': 439,
 '441': 441,
 '443': 443,
 '445': 445,
 '447': 447,
 '449': 449,
 '451': 451,
 '453': 453,
 '455': 455,
 '457': 457,
 '459': 459,
 '461': 461,
 '463': 463,
 '465': 465,
 '467': 467,
 '469': 469,
 '471': 471,
 '473': 473,
 '475': 475,
 '477': 477,
 '479': 479,
 '481': 481,
 '483': 483,
 '485': 485,
 '487': 487,
 '489': 489,
 '491': 491,
 '493': 493,
 '495': 495,
 '497': 497,
 '499': 499,
 '501': 501,
 '503': 503,
 '505': 505,
 '507': 507,
 '509': 509,
 '511': 511,
 '513': 513,
 '515': 515,
 '517': 517,
 '519': 519,
 '521': 521,
 '523': 523,
 '525': 525,
 '527': 527,
 '529': 529,
 '531': 531,
 '533': 533,
 '535': 535,
 '537': 537,
 '539': 539,
 '541': 541,
 '543': 543,
 '545': 545,
 '547': 547,
 '549': 549,
 '551': 551,
 '553': 553,
 '555': 555,
 '557': 557,
 '559': 559,
 '561': 561,
 '563': 563,
 '565': 565,
 '567': 567,
 '569': 569,
 '571': 571,
 '573': 573,
 '575': 575,
 '577': 577,
 '579': 579,
 '581': 581,
 '583': 583,
 '585': 585,
 '587': 587,
 '589': 589,
 '591': 591,
 '593': 593,
 '595': 595,
 '597': 597,
 '599': 599,
 '601': 601,
 '603': 603,
 '605': 605,
 '607': 607,
 '609': 609,
 '611': 611,
 '613': 613,
 '615': 615,
 '617': 617,
 '619': 619,
 '621': 621,
 '623': 623,
 '625': 625,
 '627': 627,
 '629': 629,
 '631': 631,
 '633': 633,
 '635': 635,
 '637': 637,
 '639': 639,
 '641': 641,
 '643': 643,
 '645': 645,
 '647': 647,
 '649': 649,
 '651': 651,
 '653': 653,
 '655': 655,
 '657': 657,
 '659': 659,
 '661': 661,
 '663': 663,
 '665': 665,
 '667': 667,
 '669': 669,
 '671': 671,
 '673': 673,
 '675': 675,
 '677': 677,
 '679': 679,
 '681': 681,
 '683': 683,
 '685': 685,
 '687': 687,
 '689': 689,
 '691': 691,
 '693': 693,
 '695': 695,
 '697': 697,
 '699': 699,
 '701': 701,
 '703': 703,
 '705': 705,
 '707': 707,
 '709': 709,
 '711': 711,
 '713': 713,
 '715': 715,
 '717': 717,
 '719': 719,
 '721': 721,
 '723': 723,
 '725': 725,
 '727': 727,
 '729': 729,
 '731': 731,
 '733': 733,
 '735': 735,
 '737': 737,
 '739': 739,
 '741': 741,
 '743': 743,
 '745': 745,
 '747': 747,
 '749': 749,
 '751': 751,
 '753': 753,
 '755': 755,
 '757': 757,
 '759': 759,
 '761': 761,
 '763': 763,
 '765': 765,
 '767': 767,
 '769': 769,
 '771': 771,
 '773': 773,
 '775': 775,
 '777': 777,
 '779': 779,
 '781': 781,
 '783': 783,
 '785': 785,
 '787': 787,
 '789': 789,
 '791': 791,
 '793': 793,
 '795': 795,
 '797': 797,
 '799': 799,
 '801': 801,
 '803': 803,
 '805': 805,
 '807': 807,
 '809': 809,
 '811': 811,
 '813': 813,
 '815': 815,
 '817': 817,
 '819': 819,
 '821': 821,
 '823': 823,
 '825': 825,
 '827': 827,
 '829': 829,
 '831': 831,
 '833': 833,
 '835': 835,
 '837': 837,
 '839': 839,
 '841': 841,
 '843': 843,
 '845': 845,
 '847': 847,
 '849': 849,
 '851': 851,
 '853': 853,
 '855': 855,
 '857': 857,
 '859': 859,
 '861': 861,
 '863': 863,
 '865': 865,
 '867': 867,
 '869': 869,
 '871': 871,
 '873': 873,
 '875': 875,
 '877': 877,
 '879': 879,
 '881': 881,
 '883': 883,
 '885': 885,
 '887': 887,
 '889': 889,
 '891': 891,
 '893': 893,
 '895': 895,
 '897': 897,
 '899': 899,
 '901': 901,
 '903': 903,
 '905': 905,
 '907': 907,
 '909': 909,
 '911': 911,
 '913': 913,
 '915': 915,
 '917': 917,
 '919': 919,
 '921': 921,
 '923': 923,
 '925': 925,
 '927': 927,
 '929': 929,
 '931': 931,
 '933': 933,
 '935': 935,
 '937': 937,
 '939': 939,
 '941': 941,
 '943': 943,
 '945': 945,
 '947': 947,
 '949': 949,
 '951': 951,
 '953': 953,
 '955': 955,
 '957': 957,
 '959': 959,
 '961': 961,
 '963': 963,
 '965': 965,
 '967': 967,
 '969': 969,
 '971': 971,
 '973': 973,
 '975': 975,
 '977': 977,
 '979': 979,
 '981': 981,
 '983': 983,
 '985': 985,
 '987': 987,
 '989': 989,
 '991': 991,
 '993': 993,
 '995': 995,
 '997': 997,
 '999': 999,
 '1001': 1001}

In [91]:
print(comp_even1['6'])

6

In [92]:
color = ['red', 'yellow', 'blue']
objects = ['shoes', 'house', 'books']
colored_objects = [ (x,y) for x in color for y in objects]
print(colored_objects)

[('red', 'shoes'), ('red', 'house'), ('red', 'books'), ('yellow', 'shoes'), ('yellow', 'house'), ('yellow', 'books'), ('blue', 'shoes'), ('blue', 'house'), ('blue', 'books')]

# NUMPY PYTHON PRACTICE

In [93]:
import numpy as np

In [94]:
a = np.array([1,2,4,5,6,6,7])
a

array([1, 2, 4, 5, 6, 6, 7])

In [95]:
b = np.array ([(45,6,6,5,3), (7,7,76)])
b

array([(45, 6, 6, 5, 3), (7, 7, 76)], dtype=object)

In [96]:
b1 = np.array([(1,2,3), (2,3,2), (4,4,3)])
b1

array([[1, 2, 3],
       [2, 3, 2],
       [4, 4, 3]])

In [97]:
a1 = [2,4,36,7,5,7,44,5,4,44]
a1

[2, 4, 36, 7, 5, 7, 44, 5, 4, 44]

In [98]:
arr1 = np.array(a1)

In [99]:
arr1

array([ 2,  4, 36,  7,  5,  7, 44,  5,  4, 44])

In [100]:
a2 = (2,2,3,3,2,3)
a2

(2, 2, 3, 3, 2, 3)

In [101]:
arr2 = np.array(a2)

In [102]:
arr2

array([2, 2, 3, 3, 2, 3])

In [103]:
from statistics import mean

In [104]:
arr2m = arr2.mean()
arr2m

2.5

In [105]:
arr1m = arr1.mean()
arr1m

15.8

In [106]:
arr2.ndim

1

In [107]:
arr2.ndim

1

In [108]:
a3 = [[2,2,2,3],[2,3,3,4],[5,6,5,6]]
a3

[[2, 2, 2, 3], [2, 3, 3, 4], [5, 6, 5, 6]]

In [109]:
type(a3)

list

In [110]:
arr3 = np.array(a3)

In [111]:
arr3

array([[2, 2, 2, 3],
       [2, 3, 3, 4],
       [5, 6, 5, 6]])

In [112]:
print(a3[-2][-4])

2

In [113]:
arr3.shape

(3, 4)

In [114]:
arr3.ndim

2

In [115]:
arr3.dtype

dtype('int32')

In [116]:
arr3m = arr3.mean()
arr3m

3.5833333333333335

In [117]:
arr3

array([[2, 2, 2, 3],
       [2, 3, 3, 4],
       [5, 6, 5, 6]])

In [118]:
a4 = [[2,4,5,np.nan], [np.nan, np.nan, 6,5], [4,5,np.nan,6]]
a4

[[2, 4, 5, nan], [nan, nan, 6, 5], [4, 5, nan, 6]]

In [119]:
type(a4)

list

In [120]:
arr4 = np.array(a4)
arr4

array([[ 2.,  4.,  5., nan],
       [nan, nan,  6.,  5.],
       [ 4.,  5., nan,  6.]])

In [121]:
arr4.shape

(3, 4)

In [122]:
arr4m = arr4.mean()
arr4m

nan

In [123]:
arr4m = np.nanmean(arr4)
arr4m

4.625

In [124]:
np.isnan(arr4)

array([[False, False, False,  True],
       [ True,  True, False, False],
       [False, False,  True, False]])

In [125]:
arr4max = np.nanmax(arr4)
arr4max

6.0

In [126]:
arr4x = np.nan_to_num(arr4)

In [127]:
arr4x

array([[2., 4., 5., 0.],
       [0., 0., 6., 5.],
       [4., 5., 0., 6.]])

In [128]:
arr4xm = arr4x.mean()
arr4xm

3.0833333333333335

# PANDAS PYTHON PRACTICE

In [129]:
import pandas as pd

In [134]:
data = {"books" : [2,4,3,5,3], "shoes" : [3,5,8,8,9], "pens" : [2,3,3,3,3], "bags" : [6,5,5,5,4]}
data

{'books': [2, 4, 3, 5, 3],
 'shoes': [3, 5, 8, 8, 9],
 'pens': [2, 3, 3, 3, 3],
 'bags': [6, 5, 5, 5, 4]}

In [132]:
df_data = pd.DataFrame(data)

In [133]:
df_data

   books  shoes  pens  bags
0      2      3     2     6
1      4      5     3     5
2      3      8     3     5
3      5      8     3     5
4      3      9     3     4

In [135]:
type(df_data)

pandas.core.frame.DataFrame

In [136]:
df_data = pd.DataFrame(data, index=["Molly", "Lilly", "Sally", "Donald", "Mark"])
df_data

        books  shoes  pens  bags
Molly       2      3     2     6
Lilly       4      5     3     5
Sally       3      8     3     5
Donald      5      8     3     5
Mark        3      9     3     4

In [137]:
type(df_data)

pandas.core.frame.DataFrame

In [139]:
a = df_data["books"]
a

Molly     2
Lilly     4
Sally     3
Donald    5
Mark      3
Name: books, dtype: int64

In [140]:
type(a)

pandas.core.series.Series

In [142]:
df_data.columns

Index(['books', 'shoes', 'pens', 'bags'], dtype='object')

In [144]:
c = df_data.columns
c[0]

'books'

In [145]:
c[-2]

'pens'

In [148]:
df_data.rename({"books":"pencils", "shoes":"bags", "pens":"colorpencils", "bags": "rulers"}, axis='columns')

        pencils  bags  colorpencils  rulers
Molly         2     3             2       6
Lilly         4     5             3       5
Sally         3     8             3       5
Donald        5     8             3       5
Mark          3     9             3       4

In [156]:
# THIS WORKS WITH THE ORIGIBAL INDEX, NOT THE CHANGES ONE AS SEEN ABOVE. 
df_data.loc["Molly", ["bags", "shoes"]]

bags     6
shoes    3
Name: Molly, dtype: int64

In [158]:
df_data.loc ["Donald", ["books", "bags"]]

books    5
bags     5
Name: Donald, dtype: int64

In [159]:
import numpy as np

In [160]:
arrd = np.array(data)

In [161]:
arrd

array({'books': [2, 4, 3, 5, 3], 'shoes': [3, 5, 8, 8, 9], 'pens': [2, 3, 3, 3, 3], 'bags': [6, 5, 5, 5, 4]},
      dtype=object)

In [165]:
df_movies = pd.read_csv("data/imdb_data_1000.csv")

In [166]:
df_movies

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [167]:
df_movies.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [175]:
df_movies.loc[0]

Rank                                                                  1
Title                                           Guardians of the Galaxy
Genre                                           Action,Adventure,Sci-Fi
Description           A group of intergalactic criminals are forced ...
Director                                                     James Gunn
Actors                Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...
Year                                                               2014
Runtime (Minutes)                                                   121
Rating                                                              8.1
Votes                                                            757074
Revenue (Millions)                                               333.13
Metascore                                                            76
Name: 0, dtype: object

In [176]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [177]:
df_movies.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [185]:
df_movies_one = df_movies.copy()

In [205]:
df_movies_one.rename(columns = {"Runtime (Minutes)": "Runtime_minutes", "Revenue (Millions)": "Revenue_millions"}, inplace=True )

In [207]:
df_movies_one.head(1)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime_minutes,Rating,Votes,Revenue_millions,Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0

In [211]:
df_movies_one.columns =  [c.lower() for c in df_movies_one.columns]

In [212]:
df_movies_one.columns

Index(['rank', 'title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_minutes', 'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

In [215]:
df_movies_one.columns = [c.upper() for c in df_movies_one.columns]

In [216]:
df_movies_one.columns

Index(['RANK', 'TITLE', 'GENRE', 'DESCRIPTION', 'DIRECTOR', 'ACTORS', 'YEAR',
       'RUNTIME_MINUTES', 'RATING', 'VOTES', 'REVENUE_MILLIONS', 'METASCORE'],
      dtype='object')

In [217]:
df_movies_one.shape

(1000, 12)

In [218]:
df_movies_one.drop_duplicates()

,RANK,TITLE,GENRE,DESCRIPTION,DIRECTOR,ACTORS,YEAR,RUNTIME_MINUTES,RATING,VOTES,REVENUE_MILLIONS,METASCORE
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [219]:
df_movies_one.shape

(1000, 12)

In [220]:
df_movies_one.drop_duplicates(keep = False, inplace = True)

In [221]:
df_movies_one.shape

(1000, 12)

In [223]:
df_movies_one.drop_duplicates(inplace = True, keep = "last")

In [224]:
df_movies_one.shape

(1000, 12)

In [249]:
temp_df = df_movies_one.append(df_movies_one)

In [250]:
temp_df.shape

(2000, 12)

In [251]:
temp_df =temp_df.append(df_movies_one)

In [252]:
temp_df.shape

(3000, 12)

In [253]:
temp_df_one = temp_df.copy()

In [254]:
temp_df_one.shape

(3000, 12)

In [261]:
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   RANK              1000 non-null   int64
 1   TITLE             1000 non-null   object
 2   GENRE             1000 non-null   object
 3   DESCRIPTION       1000 non-null   object
 4   DIRECTOR          1000 non-null   object
 5   ACTORS            1000 non-null   object
 6   YEAR              1000 non-null   int64
 7   RUNTIME_MINUTES   1000 non-null   int64
 8   RATING            1000 non-null   float64
 9   VOTES             1000 non-null   int64
 10  REVENUE_MILLIONS  872 non-null    float64
 11  METASCORE         936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 101.6+ KB

In [262]:
temp_df.drop_duplicates(inplace = True, keep = "first")

In [263]:
temp_df.shape

(1000, 12)

In [264]:
temp_df_one.drop_duplicates(keep = 'last', inplace = True)

In [265]:
temp_df_one.shape

(1000, 12)

In [266]:
temp_df_one.drop_duplicates(inplace = True, keep = False)

In [267]:
temp_df_one.shape

(1000, 12)

In [268]:
df_movies_one.shape

(1000, 12)

In [269]:
df_movies.shape

(1000, 12)

In [270]:
df_comb = df_movies_one.append(df_movies)

In [272]:
df_comb.shape

(2000, 24)

In [273]:
df_movies_one.columns

Index(['RANK', 'TITLE', 'GENRE', 'DESCRIPTION', 'DIRECTOR', 'ACTORS', 'YEAR',
       'RUNTIME_MINUTES', 'RATING', 'VOTES', 'REVENUE_MILLIONS', 'METASCORE'],
      dtype='object')

In [274]:
df_movies.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [275]:
df_comb.columns

Index(['RANK', 'TITLE', 'GENRE', 'DESCRIPTION', 'DIRECTOR', 'ACTORS', 'YEAR',
       'RUNTIME_MINUTES', 'RATING', 'VOTES', 'REVENUE_MILLIONS', 'METASCORE',
       'Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [276]:
df_movies_one.isnull()

,RANK,TITLE,GENRE,DESCRIPTION,DIRECTOR,ACTORS,YEAR,RUNTIME_MINUTES,RATING,VOTES,REVENUE_MILLIONS,METASCORE
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False,False,False,True,False
996,False,False,False,False,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False,False,False,True,False
999,False,False,False,False,False,False,False,False,False,False,False,False

In [278]:
df_movies_nulls = df_movies_one.isnull()

In [279]:
df_movies_nulls.sum()

RANK                  0
TITLE                 0
GENRE                 0
DESCRIPTION           0
DIRECTOR              0
ACTORS                0
YEAR                  0
RUNTIME_MINUTES       0
RATING                0
VOTES                 0
REVENUE_MILLIONS    128
METASCORE            64
dtype: int64

In [280]:
df_movies_one1 = df_movies_one.dropna()

In [282]:
df_movies_one1.shape

(838, 12)

In [ ]:
revenue =